# Table of Contents

This notebook is Part 1 of Exercise 4.6 and contains the following:

* Importing libraries 
* Turning project path into a string 
* Importing data sets 
* Exporting data sets

# Step 1 - Merging Files from Exercise

## 01. Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 02. Turning project path into a string

In [2]:
#Turn project folder path into a string
'/Users/aysha/Documents/Instacart Basket Analysis/'

'/Users/aysha/Documents/Instacart Basket Analysis/'

In [3]:
path = r'/Users/aysha/Documents/Instacart Basket Analysis/'

In [4]:
path

'/Users/aysha/Documents/Instacart Basket Analysis/'

## 03. Importing data sets

In [8]:
# Import the “order_products_prior.csv” file into Jupyter as df_ords_prior

df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products_prior.csv'), index_col = False)

In [12]:
# Check the output

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
df_ords_prior.shape

(32434489, 4)

In [10]:
# Import the most up-to-date version of the orders data set from the Prepared Data folder into Jupyter 

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [11]:
# Check the output

df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_customers
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [14]:
df_ords.shape

(3421083, 9)

In [22]:
# Dropping columns from df_ords 

df_ords.drop(labels=['Unnamed: 0.1', 'Unnamed: 0'], axis=1)

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_customers
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

In [23]:
df_ords.shape

(3421083, 9)

In [24]:
# Reassigning df_ords to df_ords1 (without the unnecessary columns)

df_ords1 = df_ords.drop(labels=['Unnamed: 0.1', 'Unnamed: 0'], axis=1)

In [26]:
df_ords1.shape

(3421083, 7)

In [25]:
df_ords1

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_customers
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

In [27]:
# Merging dataframes (df_ords_prior to the df_ords1 dataframe)

df_merged_large = df_ords1.merge(df_ords_prior, on = 'order_id', indicator = True)

In [28]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,days_since_prior_order,first_time_customers,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [30]:
# Check frequency
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [32]:
# Check shape of df

df_merged_large.shape

(32434489, 11)

## 04. Exporting data sets

In [33]:
# Export data to Pickel format (pkl)


df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))

In [34]:
# Export data to CSV format


df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))